# Core/Dotfiles/CLI/Binaries
brew "bash" # Latest Bash version
brew "bat" # Cat alternative
brew "coreutils" # Those that come with macOS are outdated
brew "curl" # Updated version of curl
brew "duti" # Set default applications for file types
brew "ffmpeg"
brew "gh" # GitHub CLI
brew "git"
brew "git-delta" # Syntax highlighting for git diffs
brew "git-lfs" # Large File Storage for Git
brew "htop" # Interactive process viewer
brew "imagemagick" # Image manipulation tool
brew "jless" # JSON and HTML viewer
brew "jq" # Used for spatie/visit
brew "mas" # Mac App Store manager
brew "nano"
brew "shellcheck"
brew "stow"
brew "svn" # Needed to install fonts
brew "tmux"
brew "vim"

# Fs/Network
brew "dockutil" # Dock management utility
brew "fd" # Find alternative
brew "findutils"
brew "fzf" # Fuzzy finder
brew "grep"
brew "httpie"
brew "psgrep"
brew "ripgrep" # Fast grep alternative
brew "ssh-copy-id"
brew "tree"
brew "unar"
brew "wget"
brew "zoxide" # Directory navigation tool

# Programming Languages
brew "go" # Go programming language
brew "node" # Node.js
brew "uv" # Python package and project manager

# Apps
cask "arc" # Arc browser
cask "bitwarden" # Password manager
brew "bitwarden-cli" # Bitwarden CLI
cask "caffeine" # Prevent sleep
cask "discord" # Chat app
cask "docker" # Container platform
cask "firefox" # Web browser
cask "flameshot" # Screenshot tool
cask "flux" # Screen color temperature
cask "font-fira-code" # Programming font
cask "font-hack" # Programming font
cask "fork" # Git client
cask "goland" # Go IDE
cask "google-chrome" # Web browser
cask "google-chrome@canary" # Chrome canary
cask "itsycal" # Menu bar calendar
cask "notion" # Note-taking app
cask "notion-calendar" # Calendar app
cask "postman" # API development
cask "postman-cli" # Postman CLI
cask "pycharm" # Python IDE
cask "raycast" # Productivity launcher
cask "rectangle" # Window management
cask "slack" # Team communication
cask "spotify" # Music streaming
cask "stretchly" # Break reminder
cask "sublime-text" # Text editor
cask "thebrowsercompany-dia" # Diagram tool
cask "the-unarchiver" # Archive utility
cask "visual-studio-code" # Code editor
cask "vlc" # Media player
cask "zoom" # Video conferencing

# Fonts
cask "font-lato" # Lato font
cask "font-open-sans" # Open Sans font
cask "font-roboto" # Roboto font
cask "font-source-code-pro" # Source Code Pro
cask "font-source-code-pro-for-powerline" # Powerline variant
cask "font-source-sans-3" # Source Sans 3
cask "font-source-serif-4" # Source Serif 4

# Quicklook
cask "qlmarkdown" # Markdown preview
cask "quicklook-json" # JSON preview