# ===== COMMAND LINE TOOLS =====

# Essential CLI Tools
brew "bash" # Latest Bash version
brew "bat" # Cat alternative with syntax highlighting
brew "coreutils" # Updated versions of macOS built-in tools
brew "curl" # Updated version of curl
brew "git" # Version control system
brew "htop" # Interactive process viewer
brew "jq" # Command-line JSON processor
brew "mas" # Mac App Store manager
brew "nano" # Simple text editor
brew "ripgrep" # Fast text search tool
brew "shellcheck" # Shell script static analysis tool
brew "stow" # Symlink farm manager for dotfiles
brew "tmux" # Terminal multiplexer
brew "vim" # Text editor
brew "zsh" # Z shell (enhanced shell)

# Git Tools
brew "gh" # GitHub CLI
brew "git-delta" # Syntax highlighting for git diffs
brew "git-lfs" # Large File Storage for Git

# File & Text Processing
brew "bat-extras" # Additional bat commands
brew "diff-so-fancy" # Improved diff output
brew "duti" # Set default applications for file types
brew "exiftool" # Metadata manipulation tool
brew "ffmpeg" # Multimedia framework
brew "imagemagick" # Image manipulation tool
brew "jless" # JSON and HTML viewer
brew "svn" # Needed to install fonts

# Security & Encryption
brew "gpg" # GNU Privacy Guard
brew "openssl@3" # Updated OpenSSL version

# ===== FONTS =====

# Programming Fonts (Nerd Fonts include powerline support)
cask "font-fira-code-nerd-font" # Fira Code with programming ligatures
cask "font-hack-nerd-font" # Hack font optimized for source code
cask "font-jetbrains-mono-nerd-font" # JetBrains Mono with excellent readability
cask "font-source-code-pro" # Adobe's monospaced font family
cask "font-inconsolata" # Humanist monospaced font

# System & UI Fonts
cask "font-lato" # Humanist sans-serif typeface
cask "font-open-sans" # Neutral and friendly appearance
cask "font-roboto" # Modern grotesque with a mechanical skeleton
cask "font-source-sans-3" # Sans-serif typeface for user interfaces
cask "font-source-serif-4" # Serif typeface for setting text

# ===== SYSTEM & NETWORK TOOLS =====

# File System & Search
brew "ack" # Text search tool
brew "fd" # Modern find alternative
brew "findutils" # GNU versions of find utilities
brew "fzf" # Command-line fuzzy finder
brew "tree" # Directory tree viewer
brew "unar" # Archive extraction tool
brew "zoxide" # Smarter cd command

# Network & HTTP Tools
brew "httpie" # User-friendly HTTP client
brew "ssh-copy-id" # Copy SSH keys to remote hosts
brew "wget" # Network downloader

# System Management
brew "dockutil" # Dock management utility

# ===== CLOUD & INFRASTRUCTURE TOOLS =====

brew "awscli" # Amazon Web Services CLI
brew "kubectl" # Kubernetes command-line tool
brew "terraform" # Infrastructure as code tool

# ===== SHELL ENHANCEMENTS =====

brew "zsh-autosuggestions" # Fish-like autosuggestions for zsh
brew "zsh-completions" # Additional completion definitions for zsh
brew "zsh-syntax-highlighting" # Fish-like syntax highlighting for zsh

# ===== PROGRAMMING LANGUAGES & RUNTIMES =====

brew "go" # Go programming language
brew "node" # Node.js JavaScript runtime
brew "python@3.12" # Python programming language
brew "uv" # Fast Python package and project manager
brew "yarn" # Alternative Node.js package manager

# ===== WEB BROWSERS =====

cask "arc" # Modern browser with vertical tabs
cask "thebrowsercompany-dia" # AI Browser
cask "firefox" # Privacy-focused web browser
cask "google-chrome" # Google's web browser
cask "opera" # Feature-rich web browser

# ===== DEVELOPMENT ENVIRONMENT =====

# Containerization & Virtualization
cask "docker" # Container platform

# IDEs & Text Editors
cask "goland" # JetBrains Go IDE
cask "pycharm" # JetBrains Python IDE
cask "sublime-text" # Sophisticated text editor
cask "visual-studio-code" # Microsoft's code editor
#cask "webstorm" # JetBrains JavaScript/TypeScript IDE
#cask "xcode" # Apple development environment

# Terminal & Command Line
cask "iterm2" # Advanced terminal emulator

# API Development & Testing
cask "postman" # API development platform
cask "postman-cli" # Postman command line interface

# System Requirements (uncomment if needed)
#cask "xquartz" # X11 server for macOS

# ===== SECURITY & PRIVACY =====

# Password Management
cask "bitwarden" # Cross-platform password manager
brew "bitwarden-cli" # Bitwarden command line tools

# Encryption & Security Tools
cask "gpg-suite" # Complete GPG toolkit for macOS

# ===== COMMUNICATION & COLLABORATION =====

cask "discord" # Gaming and community chat platform
cask "slack" # Team communication and collaboration
cask "zoom" # Video conferencing platform

# ===== MEDIA & ENTERTAINMENT =====

# Audio & Video (commented out - uncomment as needed)
#cask "audacity" # Open-source audio editor
#cask "handbrake" # Video transcoder
#cask "imageoptim" # Lossless image optimization
#cask "kdenlive" # Professional video editor
#cask "obs-studio" # Live streaming and recording
#cask "shotcut" # Cross-platform video editor

# Hardware & Peripherals
cask "logi-options+" # Logitech device configuration

# Music & Audio
cask "sonos" # Sonos speaker system control
cask "spotify" # Music streaming service

# Video Players
cask "vlc" # Versatile media player

# ===== PRODUCTIVITY & ORGANIZATION =====

# Note-Taking & Knowledge Management
cask "notion" # All-in-one workspace for notes and collaboration
cask "notion-calendar" # Calendar integration for Notion

# Reading & Document Management
cask "calibre" # E-book library management

# Screenshots & Screen Utilities
cask "caffeine" # Prevent system sleep
cask "flameshot" # Advanced screenshot tool

# Launchers & Quick Access
cask "raycast" # Productivity launcher and command palette

# Time & Calendar Management
cask "itsycal" # Compact menu bar calendar

# Window & Workspace Management
cask "rectangle" # Window snapping and management

# Health & Breaks
cask "stretchly" # Break and stretch reminder

# ===== SYSTEM UTILITIES =====

# Display & Visual
cask "flux" # Blue light filter for better sleep
cask "stats" # System monitor in menu bar

# File Management & Archives
cask "the-unarchiver" # Archive extraction utility

# Font Management
cask "fontbase" # Font preview and management

# ===== QUICKLOOK EXTENSIONS =====

cask "qlmarkdown" # Preview Markdown files in Finder
cask "quicklook-json" # Preview JSON files in Finder
cask "webpquicklook" # Preview WebP images in Finder